Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/E12D.tmx
Source language: en_us
Languages: zh_cn

source: How to Improve Home Air Quality for Allergy Season
zh_cn: 在过敏季节怎样改善家庭空气质量

source: For some springtime means warm sunny days spent outdoors, but for others it means fighting a seemingly futile battle against seasonal allergies.
zh_cn: 对于大部分人来说春天意味着温暖晴天户外旅行，但对另外一群人来说，这意味着无穷无尽地对抗季节性过敏。

source: The presence of pollen can mean itchy, watery eyes, constant sneezing and other uncomfortable symptoms.
zh_cn: 花粉的存在意味着发痒，流泪，打喷嚏和其它不舒服的症状。

source: Then there are people who suffer these symptoms from airborne allergies all year round.
zh_cn: 然后有这些症状的患者一年到头都从空中过敏。

source: Antihistamines can keep some symptoms at bay - but for how long?
zh_cn: 抗组胺药能缓解某些症状——但持续不久。

source: In order to enjoy true relief, it‘s important to improve the air quality in your home and get rid of allergens fast.
zh_cn: 为了享受真正的生活，重要的是要改善你家里的空气质量和尽快摆脱过敏原。

source: - One of the best ways to keep allergens out is to never bring them inside in the first place.
zh_cn: ——最好的方法之一就是永远在第一时间内使他们避免接触花粉。

source: Of course plant spores and pet dander are going to find their way in eventually, but some allergens - such as harsh chemicals and cigarette smoke - should stay far, far away from your walls and carpets.
zh_cn: 当然植物孢子和宠物皮屑将会难以避开，但有些过敏原，比如强烈的化学药品和香烟的烟雾——应该保持远离你的墙壁和地毯。

source: Amidst the worst of allergy season, be sure to wash your draperies, sheets and vacuum your carpets often.
zh_cn: 在最糟糕的过敏季节里，务必彻底清洗你的衣物、床单和经常吸尘清洁你的地毯。

source: - Another thing to think about is how allergens may be getting in.
zh_cn: ——另一个要考虑的就是怎样过敏原的进入。

source: When it comes to seasonal allergies, pollen finds many ways into your home - generally on clothes, through open windows and on the fur of your pets.
zh_cn: 当季节性过敏、花粉会以很多方式进入你的家庭—通常会在衣服上或通过敞开的窗户和你的宠物的皮毛。

source: Do your best to avoid uncomfortable contact by washing your hands before touching your face and wiping down your four legged friends after a trip outdoors.
zh_cn: 洗手以尽力避免不舒服触及你的脸和户外旅行回来之后擦干净你的四条腿的朋友。

source: Although it‘s tempting to throw open the windows on a beautiful spring day, keep them shut until your allergy season has ended.
zh_cn: 尽管在一个美丽的春日应该敞开了窗户，但请你保持关闭，直到你的过敏季节结束。

source: - Lastly, if you use a disposable air filter in your air conditioner, be sure to change it at least once every two months.
zh_cn: —最后，如果你在你的空调里使用一次性的空气过滤器，一定要至少每隔两个月更换一次。

source: If you‘re still experiencing issues, consider investing in an electronic air cleaner, which can remove allergen particles from your home.
zh_cn: 如果你仍会出现问题，请考虑购买一个可从你的家消除过敏原粒子电子空气清洁器。

source: This solution is often recommended by doctors of patients with particularly bad allergies and can provide a great deal of relief year round.
zh_cn: 医生建议的严重过敏的患者应该全年使用。
